EDT/УТ/src/Documents/ПодтверждениеПередачиЗаказовЭкипажу/ПодтверждениеПередачиЗаказовЭкипажу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПодтверждениеПередачиЗаказовЭкипажу</name>
  <registerRecords>InformationRegister.СтатусыЗапросовНаПередачуЗаказовЭкипажам</registerRecords>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Узел</name>
    <type>
      <types>ExchangePlanRef.ИзмененияДляМП</types>
    </type>
  </attributes>
  <attributes>
    <name>Запрос</name>
    <type>
      <types>DocumentRef.ЗапросНаПередачуЗаказовЭкипажу</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийСтатусЗапроса</name>
    <type>
      <types>EnumRef.СтатусыЗапросовНаПередачуЗаказовЭкипажам</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаМП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусЗапроса</name>
      <type>
        <types>EnumRef.СтатусыЗапросовНаПередачуЗаказовЭкипажам</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресДоставки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/СтатусыЗапросовНаПередачуЗаказовЭкипажам/СтатусыЗапросовНаПередачуЗаказовЭкипажам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыЗапросовНаПередачуЗаказовЭкипажам</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтатусЗапроса</name>
    <type>
      <types>EnumRef.СтатусыЗапросовНаПередачуЗаказовЭкипажам</types>
    </type>
  </resources>
  <dimensions>
    <name>ЗапросНаПередачуЗаказовЭкипажу</name>
    <type>
      <types>DocumentRef.ЗапросНаПередачуЗаказовЭкипажу</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/СтатусыЗапросовНаПередачуЗаказовЭкипажам/СтатусыЗапросовНаПередачуЗаказовЭкипажам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗапросовНаПередачуЗаказовЭкипажам</name>
  <enumValues>
    <name>ЗапросСоздан</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтклонен</name>
  </enumValues>
  <enumValues>
    <name>ЗапросПодтвержден</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/ЗапросНаПередачуЗаказовЭкипажу/ЗапросНаПередачуЗаказовЭкипажу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗапросНаПередачуЗаказовЭкипажу</name>
  <registerRecords>InformationRegister.СтатусыЗапросовНаПередачуЗаказовЭкипажам</registerRecords>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>УзелИсточник</name>
    <type>
      <types>ExchangePlanRef.ИзмененияДляМП</types>
    </type>
  </attributes>
  <attributes>
    <name>РейсИсточник</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </attributes>
  <attributes>
    <name>РейсПриемник</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортИсточник</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>ВодительИсточник</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспедиторИсточник</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортПриемник</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>ВодительПриемник</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспедиторПриемник</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаМП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УзелПриемник</name>
    <type>
      <types>ExchangePlanRef.ИзмененияДляМП</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресДоставки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/Documents/ПодтверждениеПередачиЗаказовЭкипажу/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СтатусыЗапросовНаПередачуЗаказовЭкипажам
	Движения.СтатусыЗапросовНаПередачуЗаказовЭкипажам.Записывать = Истина;
	Движения.СтатусыЗапросовНаПередачуЗаказовЭкипажам.Очистить();
	Движение = Движения.СтатусыЗапросовНаПередачуЗаказовЭкипажам.Добавить();
	Движение.Период = Дата;
	Движение.ЗапросНаПередачуЗаказовЭкипажу = Запрос;
	Движение.СтатусЗапроса = ОбщийСтатусЗапроса;
	
	СтатусПодтвержден = Перечисления.СтатусыЗапросовНаПередачуЗаказовЭкипажам.ЗапросПодтвержден;
	
	Если ОбщийСтатусЗапроса = СтатусПодтвержден Тогда
		Отбор = Новый Структура("СтатусЗапроса", СтатусПодтвержден);
		ЗаказыКПеремещению = Заказы.НайтиСтроки(Отбор);
		ЗапросРейсов = Новый Запрос;
		ЗапросРейсов.Текст = "ВЫБРАТЬ
		|	ЗапросНаПередачуЗаказовЭкипажу.РейсИсточник КАК РейсИсточник,
		|	ЗапросНаПередачуЗаказовЭкипажу.РейсПриемник КАК РейсПриемник
		|ИЗ
		|	Документ.ПодтверждениеПередачиЗаказовЭкипажу КАК ПодтверждениеПередачиЗаказовЭкипажу
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗапросНаПередачуЗаказовЭкипажу КАК ЗапросНаПередачуЗаказовЭкипажу
		|		ПО ПодтверждениеПередачиЗаказовЭкипажу.Запрос = ЗапросНаПередачуЗаказовЭкипажу.Ссылка
		|ГДЕ
		|	ПодтверждениеПередачиЗаказовЭкипажу.Ссылка = &Ссылка";
		ЗапросРейсов.УстановитьПараметр("Ссылка",Ссылка);
		Выборка = ЗапросРейсов.Выполнить().Выбрать();
		Выборка.Следующий();
		РейсИсточник = Выборка.РейсИсточник.ПолучитьОбъект();
		РейсПриемник = Выборка.РейсПриемник.ПолучитьОбъект();
		Для Каждого ЗаказКПеремещению Из ЗаказыКПеремещению Цикл
			СтрокаЗаказаВИсточнике = РейсИсточник.Заказы.Найти(ЗаказКПеремещению.Заказ);
			Если СтрокаЗаказаВИсточнике = Неопределено Тогда 
				ВызватьИсключение "Заказ " + ЗаказКПеремещению.Заказ.Номер + " отсутствует в рейсе-источнике!";
			КонецЕсли;
			Если СтрокаЗаказаВИсточнике.УдаленИзРейса Тогда 
				ВызватьИсключение "Заказ " + ЗаказКПеремещению.Заказ.Номер + " удален из рейса-источника!";
			КонецЕсли;
			СтрокаВРейсеПриемнике = РейсПриемник.Заказы.Найти(ЗаказКПеремещению.Заказ);
			Если СтрокаВРейсеПриемнике = Неопределено Тогда 
				СтрокаВРейсеПриемнике = РейсПриемник.Заказы.Добавить();
			КонецЕсли;	
			ЗаполнитьЗначенияСвойств(СтрокаВРейсеПриемнике, СтрокаЗаказаВИсточнике);
			СтрокаЗаказаВИсточнике.УдаленИзРейса = Истина;
		КонецЦикла;
		
		Попытка
			РейсИсточник.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ВызватьИсключение "Не удалось провести рейс-источник! " + ОписаниеОшибки();
		КонецПопытки;	
		
		Попытка
			РейсПриемник.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ВызватьИсключение "Не удалось провести рейс-приемник! " + ОписаниеОшибки();
		КонецПопытки;	
	КонецЕсли;	
КонецПроцедуры
